app/views/topics/_comment.html.erb

<p>
  <strong>  <%= User.find_by_id(comment.user_id).email %> sagt:</strong>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1 LIMIT 1