app/views/topics/_form.html.erb

SELECT "tags".* FROM "tags"
---
  <%= f.label :Tag %><br>
  <%= f.collection_select :tag_id, Tag.all, :id, :name, { selected: @topic.tag_id }, multiple: false %>