app/views/topics/_taglabels.html.erb

<%end%>
<%= Tag.find_by_id(tag_id).name%>
---
SELECT  "tags".* FROM "tags"  WHERE "tags"."id" = 2 LIMIT 1