app/views/topics/index.html.erb


          <%= link_to Tag.find_by_id(topic.tag).name, topic%>
---
SELECT  "tags".* FROM "tags"  WHERE "tags"."id" = ? LIMIT 1  [["id", 2]]