app/views/topics/show.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
---
  <strong>User:</strong>
<%= User.find_by_id(@topic.user_id).email %>