app/views/shared/_usernav.html.erb

SELECT "users".* FROM "users"
---
            <li class="divider"></li>
            <% User.all.each do |u| %>