app/views/penalty_entries/index.html.erb

        <td><%= penalty_entry.date.strftime("%d/%m/%Y") %></td>
        <td><%= User.find_by_id(penalty_entry.user).username %></td>
        <td><%= Penalty.find_by_id(penalty_entry.penalty).name %></td>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1
SELECT  "penalties".* FROM "penalties"  WHERE "penalties"."id" = ? LIMIT 1  [["id", 3]]