app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)

    if @comment.save
---
INSERT INTO "comments" ("body", "created_at", "topic_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "Ich probiere mal aus etwas zu kommentieren :)"], ["created_at", "2015-02-21 11:03:16.292420"], ["topic_id", 33], ["updated_at", "2015-02-21 11:03:16.292420"], ["user_id", 4]]