app/controllers/galleries_controller.rb

  def index
    @galleries = Gallery.all
---
SELECT "galleries".* FROM "galleries"