app/controllers/penalty_entries_controller.rb

  def index
    @penalty_entries = if params[:user_id]
               User.find(params[:user_id]).penalty_entries
             else
               PenaltyEntry.all
---
SELECT  "penalties".* FROM "penalties"  WHERE "penalties"."id" = ? LIMIT 1  [["id", 3]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1
SELECT "penalty_entries".* FROM "penalty_entries"  WHERE "penalty_entries"."user_id" = ?  [["user_id", 1]]
SELECT "penalty_entries".* FROM "penalty_entries"

  def create
    @penalty_entry = PenaltyEntry.new(penalty_entry_params)

    respond_to do |format|
      if @penalty_entry.save
---
INSERT INTO "penalty_entries" ("created_at", "date", "penalty_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-02-24 22:46:58.033167"], ["date", "2015-02-24"], ["penalty_id", 1], ["updated_at", "2015-02-24 22:46:58.033167"], ["user_id", 1]]

    def set_penalty_entry
      @penalty_entry = PenaltyEntry.find(params[:id])
---
SELECT  "penalty_entries".* FROM "penalty_entries"  WHERE "penalty_entries"."id" = ? LIMIT 1  [["id", 1]]