app/controllers/topics_controller.rb

  def show
  @topic = Topic.find(params[:id])
---
SELECT  "topics".* FROM "topics"  WHERE "topics"."id" = ? LIMIT 1  [["id", 2]]

  def create
    @topic = Topic.new(topic_params)

    if @topic.save
---
INSERT INTO "topics" ("content", "created_at", "tag_id", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["content", "Moinsen"], ["created_at", "2015-02-23 12:53:16.605367"], ["tag_id", 2], ["title", "Test Test Test"], ["updated_at", "2015-02-23 12:53:16.605367"], ["user_id", 4]]

  def update
    respond_to do |format|
      if @topic.update(topic_params)
---
UPDATE "topics" SET "title" = ?, "updated_at" = ?, "user_id" = ? WHERE "topics"."id" = 33  [["title", "Dies ist ein Testtopi"], ["updated_at", "2015-02-21 11:03:51.417302"], ["user_id", 4]]

  def destroy
    @topic.destroy
---
DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 37]]

    def set_topic
      @topic = Topic.find(params[:id])
---
SELECT  "topics".* FROM "topics"  WHERE "topics"."id" = ? LIMIT 1  [["id", 33]]